W6D3/art_share_api/app/models/artwork.rb

SELECT  1 AS one FROM "artworks" INNER JOIN "users" ON "users"."id" = "artworks"."artist_id" WHERE "users"."id" = $1 AND "artworks"."title" = $2 AND "artworks"."id" IS NOT NULL LIMIT $3  [["id", 2], ["title", "Man coding"], ["LIMIT", 1]]
---
    def unique_artist_title
        matched_work = Artwork.joins(:artist).where(users: {id: self.artist_id}).where(artworks: {title: self.title}).where.not(artworks: {id: self.id})
        raise 'Artist/artwork title already exists' unless matched_work.empty?