W6D3/art_share_api/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
SELECT "artworks".* FROM "artworks"
---
    def index
        debugger
        if params[:user_id]
            artwork = Artwork.where(artist_id: params[:user_id])
        else
            artwork = Artwork.all

INSERT INTO "artworks" ("title", "image_url", "created_at", "updated_at", "artist_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "abcd"], ["image_url", "12"], ["created_at", "2022-02-03 19:56:56.489660"], ["updated_at", "2022-02-03 19:56:56.489660"], ["artist_id", 5]]
---
    def create
        artwork = Artwork.new(artwork_params)
        if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "5554"], ["updated_at", "2022-02-03 20:06:03.274041"], ["id", 6]]
---
    def update
        artwork = Artwork.find(params[:id])
        if artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 6]]
---
    def destroy
        artwork = Artwork.find(params[:id])
        if artwork.destroy