W6D3/art_share_api/app/controllers/artwork_shares_controller.rb

    def index
        artwork_share = ArtworkShare.where(viewer_id: params[:user_id])
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 1]]

    def destroy
        artwork_share = ArtworkShare.find(params[:id])
        if artwork_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]