W6D3/art_share_api/app/controllers/users_controller.rb

    def index
        user = User.all
---
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Lama"], ["created_at", "2022-02-03 19:39:10.027798"], ["updated_at", "2022-02-03 19:39:10.027798"]]

    def update
        user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    def destroy
        user = User.find(params[:id])
        if user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]