W6D3/first_routes/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        user = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
---
    def destroy
        user = User.find(params[:id])
        if user.destroy